; domain
(define
	(domain world-of-blocks)
	(:requirements :adl)
	(:predicates
		(on-top ?x ?y)
		(on-floor ?x)
		(clear ?x)
		(holding ?x)
	)
	; przesuñ paczkê na pod³ogê
	(:action podnies-z-paczki
		:parameters (?x ?z)
		:precondition
		(and
			(clear ?x)
			(on-top ?x ?z)
			(not (exists (?p) (holding ?p)))
		)
		:effect
		(and
			(not (on-top ?x ?z))
			(clear ?z)
			(holding ?x)
		)
	)
	; opusc na paczke
	(:action opusc-na-paczke
		:parameters (?y ?x)
		:precondition
		(and
			(holding ?x)
			(clear ?y)
			(not (= ?x ?y))
		)
		:effect
		(and
			(on-top ?x ?y)
			(not (clear ?y))
			(not (holding ?x))
		)
	)
	; opuszczenie na podloge
	(:action opusc-na-podloge
	    :parameters (?x)
	    :precondition
	    (and
	        (holding ?x)
	    )
	    :effect
	    (and
	        (on-floor ?x)
	        (not (holding ?x))
	    )
	)
	; podnoszenie z podlogi
	(:action podnies-z-podlogi
	    :parameters (?x)
	    :precondition
	    (and
	        (not (exists (?p) (holding ?p)))
	        (on-floor ?x)
	        (clear ?x)
	    )
	    :effect
	    (and
	        (holding ?x)
	        (not (on-floor ?x))
	    )
 
	)
)

; problem
(define (problem p1)
	(:domain world-of-blocks)
	(:objects a b c d e)
	(:init
		(clear c)
		(on-top c b)
		(on-top b a)
		(on-floor a)
		(clear e)
		(on-top e d)
		(on-floor d)
	)
	(:goal
		(forall (?p) (on-floor ?p))
	)
)

; plan
1. (podnies-z-paczki c b)
   deleted: (on-top c b)
   added: (clear b) (holding c)
   goals met: 0 of 1
2. (opusc-na-podloge c)
   deleted: (holding c)
   added: (on-floor c)
   goals met: 0 of 1
3. (podnies-z-paczki b a)
   deleted: (on-top b a)
   added: (clear a) (holding b)
   goals met: 0 of 1
4. (opusc-na-podloge b)
   deleted: (holding b)
   added: (on-floor b)
   goals met: 0 of 1
5. (podnies-z-paczki e d)
   deleted: (on-top e d)
   added: (clear d) (holding e)
   goals met: 0 of 1
6. (opusc-na-podloge e)
   deleted: (holding e)
   added: (on-floor e)
   goals met: 1 of 1
